tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

##############################
#           TOOLS            # 
##############################

brew "fish"
brew "git"
cask "docker"
brew "scc"  # lines of code counter

##############################
#         LANGUAGES          # 
##############################

# rust
brew "rustup-init"

# python
brew "python@3.10"

# node
brew "nvm"
brew "yarn"

# latex
cask "mactex-no-gui"
brew "perl"  # overwrite default mac version that doesn't work with latexindent

##############################
#            APPS            # 
##############################

brew "mas"  # gives integration with the mac app store

# menu bar apps
cask "stats"  # CPU, RAM, etc. usage
mas "Hidden Bar", id: 1452453066  # hide random menu items
mas "Amphetamine", id: 937984704  # turn on to prevent display from sleeping
cask "bluesnooze"  # turn off Bluetooth when lid closed
mas "Balance Lock", id: 1019371109  # fixes audio balance bug

# safari extensions
mas "Accelerate", id: 1459809092  # speed up/slow down videos
mas "AdGuard for Safari", id: 1440147259
mas "Hush", id: 1544743900  # hides cookie popups

# general mac apps
# TODO install vscode here
mas "Slack", id: 803453959
mas "Spark", id: 1176895641

# mac utilities
mas "The Unarchiver", id: 425424353
mas "CleanMyMac X", id: 1339170533
cask "glance-chamburr"  # adds quick look for more file types

##############################
#            MISC            # 
##############################

# TODO: audit this. 
# don't know wtf half of these do

brew "glib"
brew "pkg-config"
brew "cairo"
brew "libdap"
brew "gdal"
brew "gnuplot"
brew "poppler-qt5"
