tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

##############################
#         ESSENTIALS         # 
##############################

brew "fish"
brew "git"
cask "basictex"

##############################
#         LANGUAGES          # 
##############################

# rust
brew "rustup-init"

# python
brew "python@3.10"

# c/c++
brew "gcc"
brew "llvm"

# node
brew "nvm"
brew "yarn"

##############################
#            APPS            # 
##############################

brew "mas"  # gives integration with the mac app store

# menu bar apps
cask "stats"  # CPU, RAM, etc. usage
mas "Hidden Bar", id: 1452453066  # hide random menu items
mas "Amphetamine", id: 937984704  # turn on to prevent display from sleeping
cask "bluesnooze"  # turn off bluetooth when lid closed
mas "Balance Lock", id: 1019371109  # fixes audio balance bug

# safari extensions
mas "Accelerate", id: 1459809092  # speed up/slow down videos
mas "AdGuard for Safari", id: 1440147259
mas "Hush", id: 1544743900  # hides cookie popups

# general mac apps
mas "iMovie", id: 408981434
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
cask "qlstephen"  # allowes quick look of more filetypes
cask "docker"

# mac utilities
mas "The Unarchiver", id: 425424353
mas "CleanMyMac X", id: 1339170533
cask "wkhtmltopdf"

##############################
#            MISC            # 
##############################

# TODO: audit this. 
# don't know wtf half of these do

brew "glib"
brew "pkg-config"
brew "sqlite"  # needed by python
brew "cairo"
brew "cpanminus"
brew "libdap"
brew "gdal"
brew "gnuplot"
brew "perl"
brew "poppler-qt5"
